import { Component, OnInit } from '@angular/core';

class TimeBlock {
    index: number = 10000;
    type: string;
    time: string;
    content: string;
    source: string;

    constructor(
        type: string,
        time: string,
        content: string,
        source: string,
    ) {
        this.time = time;
        this.content = content;
        this.type = type;
        this.source = source;
    }
}


@Component({
    selector: 'app-aika-timeline',
    templateUrl: './aika-timeline.component.html',
    styleUrls: ['./aika-timeline.component.scss']
})
export class AikaTimelineComponent implements OnInit {

    data = [
        ['node', ``, ``, ''],
        ['company', `叢雲時期`, ``, ''],
        ['node', `愛花進入叢雲初期`, ``, ''],
        ['company', `成子坂時期`, ``, ''],
        ['node', `移籍成子坂`, ``, ''],
        ['title', `秋季作戰後`, ``, ''],
        ['node', ``, ``, ''],
        ['node', ``, ``, ''],
        ['node', ``, ``, ''],
        ['node', ``, ``, ''],
    ];
    data2 = [
        ['node', '相河愛花\n1★角色劇情1', ''],
        ['node', '相河愛花\n2★角色劇情1', ''],
        ['node', '相河愛花\n3★角色劇情1', ''],
        ['node', '相河愛花\n3★角色劇情2', ''],
        ['node', '相河愛花\n3★角色劇情3', ''],
        ['node', '相河愛花\n4★角色劇情1', ''],
        ['node', '相河愛花\n4★角色劇情2', ''],
        ['node', '相河愛花\n4★角色劇情3', ''],
        ['node', '相河愛花\nAN角色劇情', ''],
        ['node', '相河愛花\n羈絆劇情EP1', ''],
        ['node', '相河愛花\n羈絆劇情EP2', ''],
        ['node', '相河愛花\n羈絆劇情EP3', ''],
        ['node', '相河愛花\n羈絆劇情EP4', ''],
        ['node', '相河愛花\n羈絆劇情EP5', ''],
        ['node', '一条綾香\n3★角色劇情1', ''],
        ['node', '一条綾香\n3★角色劇情2', ''],
        ['node', '一条綾香\n3★角色劇情3', ''],
        ['node', '一条綾香\nFA角色劇情1', ''],
        ['node', '一条綾香\n羈絆劇情EP1', ''],
        ['node', '一条綾香\n羈絆劇情EP2', ''],
        ['node', '一条綾香\n羈絆劇情EP3', ''],
        ['node', '一条綾香\n羈絆劇情EP4', ''],
        ['node', '一条綾香\n羈絆劇情EP5', ''],
        ['node', '小芦睦海\n1★角色劇情1', ''],
        ['node', '小芦睦海\n3★角色劇情2', ''],
        ['node', '小芦睦海\n3★角色劇情3', ''],
        ['node', '小芦睦海\n4★角色劇情1', ''],
        ['node', '小芦睦海\n4★角色劇情2', ''],
        ['node', '小芦睦海\n4★角色劇情3', ''],
        ['node', '小芦睦海\n羈絆劇情EP1', ''],
        ['node', '比良坂夜露\n4★角色劇情1', ''],
        ['node', '吾妻楓\n3★角色劇情1', ''],
        ['node', '日向リン\n4★角色劇情1', ''],
        ['node', '小鳥遊怜\n2★角色劇情1', ''],
        ['node', '小鳥遊怜\n3★角色劇情1', ''],
        ['node', '二子玉舞\n3★角色劇情1', ''],
        ['node', '二子玉舞\n3★角色劇情2', ''],
        ['node', '文島明日翔\n4★角色劇情1', ''],
        ['node', '文島明日翔\n4★角色劇情2', ''],
        ['node', '文島明日翔\n4★角色劇情3', ''],
        ['node', '大関小結\n2★角色劇情1', ''],
        ['node', '宇佐元杏奈\n3★角色劇情2', ''],
        ['node', '宇佐元杏奈\n羈絆劇情EP1', ''],
        ['node', '宇佐元杏奈\n羈絆劇情EP5', ''],
        ['node', '神宮寺真理\n3★角色劇情3', ''],
        ['node', '神宮寺真理\n羈絆劇情EP4', ''],
        ['node', '神宮寺真理\n羈絆劇情EP5', ''],
        ['node', '萬場盟華\n2★角色劇情1', ''],
        ['node', 'ミア・V\n羈絆劇情EP1', ''],
        ['node', 'ミア・V\n羈絆劇情EP3', ''],
        ['node', 'ミア・V\n羈絆劇情EP4', ''],
        ['node', '東雲チヱ\n3★角色劇情1', ''],
        ['node', '御蔵座梓希\n羈絆劇情EP1', ''],
        ['node', '山野薫子\n3★角色劇情1', ''],
        ['node', '山野薫子\n3★角色劇情3', ''],
        ['node', '二階堂司\n2★角色劇情1', ''],
        ['node', '御茶ノ水美里江\n3★角色劇情1', ''],
        ['node', 'リタ・H\n羈絆劇情EP5', ''],
        ['node', '源内あお\n4★角色劇情2', ''],
        ['node', '源内あお\n4★角色劇情3', ''],
        ['node', '宮藤芳佳\n3★角色劇情1', ''],
        ['node', 'ペリーヌ・C\n3★角色劇情1', ''],
        ['node', 'ペリーヌ・C\n4★角色劇情2', ''],
        ['node', 'ペリーヌ・C\n羈絆劇情EP2', ''],
        ['node', '星月みき\n4★角色劇情1', ''],
        ['node', '常磐くるみ\n4★角色劇情1', ''],
        ['node', '常磐くるみ\n4★角色劇情2', ''],
        ['node', '常磐くるみ\n4★角色劇情3', ''],
        ['node', '常磐くるみ\n羈絆劇情EP1', ''],
        ['node', '楠明日葉\n4★角色劇情3', ''],
        ['node', '煌上花音\n4★角色劇情2', ''],
        ['node', 'ヤマダ\n羈絆劇情EP1', ''],
        ['node', 'ターニャ\n羈絆劇情EP3', ''],
        ['node', '', ``],
        ['node', '躍進編2章52', ''],
        ['node', '躍進編2章53', ''],
        ['node', '躍進編2章55', ''],
        ['node', '躍進編2章58', ''],
        ['node', '躍進編2章62', ''],
        ['node', '躍進編2章64', ''],
        ['node', '躍進編3章74', ''],
        ['node', '躍進編4章88', ''],
        ['node', '躍進編5章89', ''],
        ['node', '躍進編5章90', ''],
        ['node', '躍進編5章94', ''],
        ['node', '躍進編5章102', ''],
        ['node', '躍進編6章106', ''],
        ['node', '躍進編7章117', ''],
        ['node', '躍進編7章120', ''],
        ['node', '躍進編8章144', ''],
        ['node', '陰謀編1章145', ''],
        ['node', '激動編2章227', ''],
        ['node', '激動編3章\n地圖最下邊的劇情格子', ''],
        ['node', '激動編4章237', ''],
        ['node', '激動編4章240', ''],
        ['node', '激動編5章244', ''],
        ['node', '激動編5章249', ''],
        ['node', '覚醒編1章266', ''],
        ['node', '覚醒編2章283', ''],
        ['node', '覚醒編5章340', ''],
        ['node', '侵蝕編2章410', ''],
        ['node', '侵蝕編3章\n地圖右上兩分支的下面那條尾端的劇情格子', ''],
        ['node', '侵蝕編6章444', ''],
        ['node', '侵蝕編6章461', ''],
        ['node', '侵蝕編7章477', ''],
        ['node', '', ``],
        ['node', '員工旅遊\nボーナスは社員旅行', ``],
        ['node', '成為偶像\nアイドル誕生！', ``],
        ['node', '\n杏奈のやって★トライ 後編', ``],
        ['node', '紅花餐車\n噂の屋台 ちゅうかな娘々', ``],
        ['node', '聯動FAG-2\nスティ子も来たよ！', ``],
        ['node', '臨海公園\n臨海公園でつかまえて', ``],
        ['node', '真理作夢\n隊長代行アタッカー薫子！ 外伝 ドリィミー真理', ``],
        ['node', '擁抱馬鞭草\nバーベナを抱きしめて', ``],
        ['node', '聖誕節2018\n成子坂のメリークリスマス', ``],
        ['node', '聖誕節2019\n', ``],
        ['node', '聖誕節2020\n', ``],
        ['node', '聖誕節2021\n', ``],
        ['node', '聯動\nストライクウィッチーズコラボ 交差する空', ``],
        ['node', '年底敲鐘2018', ``],
        ['node', '年底敲鐘2019', ``],
        ['node', '年底敲鐘2020', ``],
        ['node', '年底敲鐘2021', ``],
        ['node', '年底敲鐘2022', ``],
        ['node', '南國幻想\n南国幻想(トロピカルビーチ) あんなのクイズでぴょん！ぴょん！-外伝-', ``],
        ['node', '畢業', `AN愛花角色劇情`],
    ]

    blocks: TimeBlock[] = [];

    ngOnInit(): void {
        for (let i = 0; i < this.blocks.length; i++) {
            const element = this.blocks[i];
            element.index = 10000 + i;
        }
    }




}
