import { Component, OnInit } from '@angular/core';
import { TimeLine } from '../model/timeline';
import { CommonModule } from '@angular/common';

@Component({
    selector: 'app-aika-timeline',
    standalone: true,
    imports: [
        CommonModule,
    ],
    templateUrl: './aika-timeline.component.html',
    styleUrl: './aika-timeline.component.scss'
})
export class AikaTimelineComponent implements OnInit {
    timelines: TimeLine[] = [
        { source: "", time: "vvvv 愛花在 叢雲 vvvv", text: "" },

        { source: "一条綾香，羈絆劇情1", time: "愛花、綾香，入職叢雲第一天", text: "愛花、綾香，入職叢雲第一天" },
        { source: "一条綾香，羈絆劇情2", time: "同日", text: "愛花當綾香的翻譯，叢雲組剛好遇到要出擊" },
        { source: "一条綾香，羈絆劇情3", time: "?,傍晚~次日", text: "叢雲組慶祝首次出擊，給愛花&綾香同款皇冠禮物" },
        { source: "一条綾香，羈絆劇情4", time: "?,早上", text: "綾香傲驕，愛花傷心" },
        { source: "一条綾香，羈絆劇情5", time: "同日~數日後", text: "綾香跟愛花成為好朋友", },

        { source: "シロワニ　～アクアワールド・大洗～", time: "?\n主要劇情部份是愛花還在叢雲時期", text: "" },

        { source: "", time: "vvvv 愛花在 成子坂 vvvv 推測是4月底", text: "" },

        { source: "躍進編2章52", time: "?", text: "愛花入職成子坂" },
        { source: "躍進編2章53", time: "同日,早上", text: "愛花跟綾香請求出擊" },
        { source: "躍進編2章55", time: "同日,中午", text: "夜露請愛花、綾香兩人出去咖啡廳? ，在這有遇到小結" },
        { source: "躍進編2章58", time: "同日,下午", text: "成子坂裝備強化計畫，愛花想要可愛的gear" },
        { source: "躍進編2章62", time: "同日,下午", text: "組隊會議，愛花想出擊" },

        { source: "相河愛花，1★角色劇情1", time: "同日,下午", text: "愛花在成子坂訓練室，但是家裡太忙，要回去幫忙" },

        { source: "躍進編2章64", time: "1日後,上午?", text: "四谷回來" },
        { source: "躍進編3章74", time: "?", text: "成子坂，新宿地區的vice擊退點數補完，愛花:都是大家活躍的功勞" },
        { source: "躍進編4章88", time: "?", text: "兩大型vice擊破，愛花開心，然而後面被阿瑪女超越" },
        { source: "躍進編5章89", time: "?", text: "部份地區的vice擊退優先給阿瑪女處理，成子坂次位，愛花會加油的" },
        { source: "躍進編5章90", time: "1日後,中午", text: "成子坂要招新人，同樣新人的愛花只知道叢雲組" },
        { source: "躍進編5章94", time: "3日後", text: "愛花期待阿星帶來的新人" },
        { source: "躍進編5章102", time: "4日後,下午?\n愛花穿著制服，推測放學後", text: "阿星把睦海拐來成子坂，愛花睦海綾香組成一隊" },

        { source: "小芦睦海，1★角色劇情1", time: "?", text: "愛花、睦海、四谷在指揮室談睦海的第一次約會" },
        { source: "相河愛花，2★角色劇情1", time: "?,早上\n這時睦海跟綾香還不熟，推測睦海剛入職後沒多久", text: "愛花上學路上遇到睦海", },

        { source: "相河愛花，羈絆劇情1", time: "", text: "愛花幫成子坂辦公室裝飾花" },
        { source: "相河愛花，羈絆劇情2", time: "?\n是假日" },
        { source: "相河愛花，羈絆劇情3", time: "同日", text: "3人到公園" },
        { source: "相河愛花，羈絆劇情4", time: "?", text: "3人在整備室" },
        { source: "相河愛花，羈絆劇情5", text: "愛花、綾香、睦海隊伍正式命名馬鞭草" },

        { source: "相河愛花，3★角色劇情1", time: "?", location: "成子坂附近公園中的走道", text: "愛花給綾香睦海解說生日花" },
        { source: "相河愛花，3★角色劇情2", time: "同日", location: "成子坂休息室", text: "愛花給叢雲組3人解說生日花" },
        { source: "相河愛花，3★角色劇情3", time: "同日", location: "成子坂辦公室", text: "愛花給成子坂組3人解說生日花" },

        { source: "相河愛花，4★角色劇情1", time: "?\n這時綾香、夜露已經有專屬服裝", text: "愛花拿到4星服，名字叫 ホワイトメリー" },
        { source: "相河愛花，4★角色劇情2", time: "同日~次日", text: "愛花捨不得穿專屬衣服", },
        { source: "相河愛花，4★角色劇情3", time: "同日~次日", text: "愛花可憐專屬衣服，想一起穿回家" },

        { source: "躍進編6章106", time: "?,下午", text: "愛花跟綾香外出的期間，YOYO過來，愛花跟綾香妄想四谷養小白臉才這麼窮", },
        { source: "躍進編7章117", time: "?", text: "馬鞭草3人跟夜露一起訓練，愛花睦海夜露+整備班幾人在整備室煮飯，綾香先跑了，成子坂食堂重新啟用" },
        { source: "躍進編7章120", time: "?", text: "馬鞭草3人到咖啡廳找小結，艾理入職成子坂" },
        { source: "躍進編8章144", time: "?", text: "馬鞭草三人都穿制服，在成子坂外面開心，成子坂贏了區域爭奪戰\n推測3人是一起來到成子坂" },

        { source: "陰謀編1章145", time: "?", text: "社長來成子坂談贊助，愛花接待社長進來" },


        { source: "", time: "vvvv aki作戰 vvvv", text: "VICE群落討伐\n這時代還有熊貓存在" },

        { source: "激動編2章227", time: "?\n推測接近8月，舞提到太忙可能會卡到comiket的排程(可能8月10~12之間)", text: "東京女演員聯盟成立，隊長當指揮官，馬鞭草三人幹勁滿滿" },
        { source: "激動編3章，地圖最下邊的劇情格子", time: "?", location: "整備室", text: "馬鞭草三人都穿1星衣服，準備出擊，日常綾香睦海小鬥嘴" },
        { source: "激動編4章237", time: "?", text: "AEGiS要來新隊長，綾香震驚，愛花說綾香很中意隊長阿~" },
        { source: "激動編4章240", time: "?", text: "薰子來成子坂輔助隊長工作，愛花希望能繼續讓隊長指揮戰鬥，愛花了解到四谷是薰子的學生" },
        { source: "激動編5章244", time: "?", text: "桑蒂來成子坂，作戰鬥訓練教官，愛花開心，希望能學到戰鬥方法" },
        { source: "噂の屋台ちゅうかな娘々", time: "?\n在 激動編5章249 之前，愛花跟綾香去過紅花的小攤車，睦海一個人來吃過。愛花貓舌出自這裡" },
        { source: "激動編5章249", time: "?", text: "來彌帶紅花來成子坂，愛花注意到是以前(可能是叢雲時期)跟綾香一起去吃過的店的人" },

        { source: "萬場盟華，2★角色劇情1", time: "?", text: "社長給愛花化妝" },


        { source: "", time: "vvvv aki作戰結束，夜露說只過了數日 vvvv", text: "" },

        { source: "覚醒編1章266", time: "?", text: "成子坂組3人aki作戰回來，愛花歡迎3人回來，在電視上看3人很感動，同時馬鞭草在隊伍排名持續第一名，這是主線第一次提到馬鞭草的隊伍名" },
        { source: "相河愛花，AN角色劇情", time: "?\n推測在8/7之前，愛花履歷是14歲，AN讀取圖還是14歲\n綾香睦海已經先拿到同樣AN服", text: "愛花拿到AN服，名字叫 マリー\n這裡的愛花介紹圖是藍澄3年級，14歲\n夜露稱愛花看起來有大人的感覺" },

        { source: "御蔵座梓希，羈絆劇情1", time: "?,晚上\n可能是下班時間", text: "愛花一人在整備室要找手帕，看到梓希的黑影被嚇跑了。回到休息室跟綾香睦海說這事，睦海說昨天傍晚也看過。三人聽到一些聲音，一起到整備室看看，愛花綾香又被梓希嚇到，睦海開燈，但是已經沒看到梓希，愛花找到手帕\n(馬鞭草三人都穿制服)" },
        { source: "覚醒編2章283", time: "?", text: "馬鞭草3人說在成子坂看到幽靈(梓希，愛花說梓希好可愛，驚訝是小學生" },
        { source: "覚醒編5章340", time: "?", text: "成子坂正式接受社長贊助，社長要開服裝展，愛花也想去看可愛的服裝" },


        { source: "侵蝕編2章410", time: "?", text: "" },
        { source: "侵蝕編3章，地圖右上兩分支的下面那條尾端的劇情格子", time: "?", text: "" },
        { source: "侵蝕編6章444", time: "?", text: "" },
        { source: "侵蝕編7章477", time: "?", text: "" },


        { source: "一条綾香，FA角色劇情1", time: "" },

        { source: "相河愛花，FA角色劇情1", time: "?,", text: "讀取圖的愛花還是寫14歲，推測是8/7之前，愛花將來要做什麼，想要繼續做女演員，同時又想要做花店" },
        { source: "相河愛花，FA角色劇情2", time: "?", text: "" },
        { source: "相河愛花，FA角色劇情3", time: "?", text: "馬鞭草3人穿FA衣服" },

        { source: "一条綾香，3★角色劇情1", time: "" },
        { source: "一条綾香，3★角色劇情2", time: "" },
        { source: "一条綾香，3★角色劇情3", time: "" },





        { source: "小芦睦海，3★角色劇情2", time: "" },
        { source: "小芦睦海，3★角色劇情3", time: "" },

        { source: "小芦睦海，4★角色劇情1", time: "" },
        { source: "小芦睦海，4★角色劇情2", time: "" },
        { source: "小芦睦海，4★角色劇情3", time: "" },

        { source: "小芦睦海，FA角色劇情1", time: "", text: "提到世界大會決勝日剛好卡到aki作戰，aki作戰作戰結束後，很少遇到大鳥打遊戲" },
        { source: "小芦睦海，FA角色劇情2", time: "" },
        { source: "小芦睦海，FA角色劇情3", time: "?", text: "睦海vs大鳥" },

        { source: "小芦睦海，羈絆劇情1", time: "? 可能是睦海入職成子坂第一天", text: "愛花、睦海遇到四谷，聊起睦海的第一次約會" },

        { source: "比良坂夜露，4★角色劇情1", time: "" },
        { source: "吾妻楓，3★角色劇情1", time: "" },
        { source: "日向リン，4★角色劇情1", time: "" },
        { source: "小鳥遊怜，2★角色劇情1", time: "" },
        { source: "小鳥遊怜，3★角色劇情1", time: "" },
        { source: "二子玉舞，3★角色劇情1", time: "" },
        { source: "二子玉舞，3★角色劇情2", time: "" },

        { source: "文島明日翔，4★角色劇情1", time: "" },
        { source: "文島明日翔，4★角色劇情2", time: "" },
        { source: "文島明日翔，4★角色劇情3", time: "" },

        { source: "大関小結，2★角色劇情1", time: "" },

        { source: "宇佐元杏奈，3★角色劇情2", time: "" },
        { source: "宇佐元杏奈，羈絆劇情1", time: "" },
        { source: "宇佐元杏奈，羈絆劇情5", time: "" },
        { source: "神宮寺真理，3★角色劇情3", time: "" },
        { source: "神宮寺真理，羈絆劇情4", time: "" },
        { source: "神宮寺真理，羈絆劇情5", time: "" },

        { source: "ミア・V，羈絆劇情1", time: "" },
        { source: "ミア・V，羈絆劇情3", time: "" },
        { source: "ミア・V，羈絆劇情4", time: "" },

        { source: "東雲チヱ，3★角色劇情1", time: "" },

        { source: "山野薫子，3★角色劇情1", time: "" },
        { source: "山野薫子，3★角色劇情3", time: "" },
        { source: "二階堂司，2★角色劇情1", time: "" },
        { source: "御茶ノ水美里江，3★角色劇情1", time: "?", text: "愛花(?)跟美里江逛街買東西閒聊，愛花說機器人就該有機器人的樣子。可能是夢境，alice產生的假愛花" },
        { source: "リタ・H，羈絆劇情5", time: "" },
        { source: "ノエル・F，4★角色劇情3", time: "?", text: "出擊回來的馬鞭草3人遇到正要出擊的諾艾爾" },
        { source: "ノエル・F，羈絆劇情4", time: "?", text: "愛花驚訝(?)，綾香一直吹諾艾爾身為英雄的妹妹實力一定非常強，但實際能力卻差非常多。愛花感動，諾艾爾老是被跟姐姐比較，壓力山大，但還是一直以姐姐做為目標" },


        { source: "バーゼラルド，4★角色劇情1", time: "" },
        { source: "バーゼラルド，羈絆劇情1", time: "" },
        { source: "バーゼラルド，羈絆劇情2", time: "" },
        { source: "バーゼラルド，羈絆劇情3", time: "" },
        { source: "源内あお，4★角色劇情2", time: "" },
        { source: "源内あお，4★角色劇情3", time: "" },
        { source: "宮藤芳佳，3★角色劇情1", time: "" },
        { source: "ペリーヌ・C，3★角色劇情1", time: "" },
        { source: "ペリーヌ・C，4★角色劇情2", time: "" },
        { source: "ペリーヌ・C，羈絆劇情2", time: "" },
        { source: "星月みき，4★角色劇情1", time: "" },
        { source: "常磐くるみ，4★角色劇情1", time: "" },
        { source: "常磐くるみ，4★角色劇情2", time: "" },
        { source: "常磐くるみ，4★角色劇情3", time: "" },
        { source: "常磐くるみ，羈絆劇情1", time: "" },
        { source: "楠明日葉，4★角色劇情3", time: "" },
        { source: "煌上花音，4★角色劇情2", time: "" },
        { source: "芹沢蓮華，4★角色劇情2", time: "" },
        { source: "ヤマダ，羈絆劇情1", time: "" },
        { source: "ターニャ，羈絆劇情3", time: "" },
        { source: "初音 ミク，羈絆劇情3", time: "" },
        { source: "CC，4★角色劇情2", time: "" },
        { source: "佐伯 リツカ，羈絆劇情2", time: "" },

        // 活動

        { source: "アイドル誕生！", time: "" },
        { source: "ボーナスは社員旅行", time: "" },
        { source: "杏奈のやって★トライ", time: "" },
        { source: "杏奈のやって★トライ 番外編", time: "" },
        { source: "ドリィミー真理", time: "" },
        { source: "バーベナを抱きしめて", time: "" },
        { source: "あんなのクイズでぴょん！ぴょん！", time: "" },
        { source: "南国幻想(トロピカルビーチ) あんなのクイズでぴょん！ぴょん！-外伝-", time: "" },
        { source: "はじめてのABO 　～はたらくふたごちゃん～", time: "" },
        { source: "AEGiS P-1GP ホクホク伝説", time: "" },
        { source: "VERBENA キャラクターソング発売記念", time: "" },
        { source: "大好きな隊長へ～アクトレス\nより愛をこめて～", time: "" },
        { source: "すばらしき世界の旅～あぁ、新宿慕情編～", time: "" },
        { source: "ちょこれぇと混成曲", time: "" },
        { source: "OST4発売直前記念", time: "" },
        { source: "TOKYO UNDERSHARD", time: "" },
        { source: "臨海公園でつかまえて", time: "" },


        // 週年
        { source: "ことほげ!!!　～成子坂への招待状～", time: "" },

        // 聖誕
        { source: "成子坂のメリークリスマス", time: "" },
        { source: "チョリ～クリスマッス♪", time: "" },
        { source: "クリスマスミステリー　北海道エクスプレス", time: "" },
        { source: "年末中野ジャンボドリーム -チョリ～クリスマッス♪-", time: "" },

        // 過年
        { source: "東京シャード：大晦日", time: "" },

        // 聯動
        { source: "あおが隊長になっちゃった！", time: "" },
        { source: "スティ子も来たよ！", time: "" },
        { source: "バトルガールハイスクールコラボ 神樹ヶ峰編", time: "" },
        { source: "ストライクウィッチーズ × アリス・ギア・アイギスコラボイベント新たなる空", time: "" },
        { source: "バトルガール ハイスクール コラボ 再会編", time: "" },
        { source: "アリス・ギア・アイギス × バトルガール ハイスクール コラボアイランドゲーム編", time: "" },
        { source: "メガミデバイス SOL ラプターコラボ 成子坂プラスチックモデラーズ", time: "" },
        { source: "DEAD OR ALIVE XtremeVenus Vacation × アリス・ギア・アイギスコラボ", time: "" },
        { source: "愛花でぴょんぴょん", time: "" },

        // 推播
        { source: "2018 愛花生日", time: "8/7", text: "", comment: "相河愛花「誕生日にお花をもらったんです。 この子をはやく活けてあげないと･･････ 隊長さん、花瓶をもってきてもらえませんか? お、お願いしますっ!」" },
        {
            source: "2019 愛花生日", time: "8/7", text: "", comment: `HappyBirthday相河愛花🌻
睦海「愛花、誕生日おめでと」
愛花「あれっ?睦海ちゃん、ラスベガスシャードに行ってたんじゃ･･･」
睦海「さつき帰ってきたトコ。これ、誕生日プレゼント」
愛花「わぁっ!暑いでしょ 、あがってあがって一つ」
睦海「ん、おじゃまします。 愛花 「それで、大会はどうだったの?」`},
        {
            source: "2020 愛花生日", time: "8/7", text: "", comment: `HappyBirthday相河愛花💐
愛花「綾香ちゃん、変じゃないかな?」
綾香「あたしが選んだのよ。変なわけないじゃない。よく似合ってる。」
愛花「ほんとっ?えへへ･･･うれしいな」`},
        {
            source: "2021 愛花生日", time: "8/7", text: "", comment: `HappyBirthday相河愛花🌻
綾香「いい？3時にあたしの家だからね」
愛花「うん、大丈夫。忘れてないよ～」
綾香「手ぶらで来るのよ」
愛花「わかってるってば～」
綾香「暑いんだから帽子を忘れないこと」
愛花「はーいっ、忘れません」

睦海＆綾香「誕生日おめでとう！」
愛花「ありがと～！」
睦海「これ、プレゼント」
愛花「わぁ、ノートかわいい～」
綾香「あたしからはこれよ！」
愛花「これなぁに？」
綾香「香水ペンよ！」
愛花「睦海ちゃん、綾香ちゃん、ありがとう。大切にするねっ」`},
        {
            source: "2022 愛花生日", time: "8/7", text: "", comment: `HappyBirthday 相河愛花💐
睦海「愛花、誕生日おめでとう」
愛花「ありがとう～」
綾香「さ、準備できた？いくわよ！」
愛花「行くってどこに？」
睦海「サンプル、できたみたいだから」
愛花「わ～い！」`},
        {
            source: "2023 愛花生日", time: "8/7", text: "", comment: `HappyBirthday相河愛花🎇
愛花「昨日の花火キレイだったなー」
綾香「ま、夏らしいわよね」
睦海「そう、夏といえば花火」
愛花「わっ、それ･･･!」
睦海「泊りなら一緒にやる時間あるかなと思って」
綾香「ふーん、こういう花火もあるのね」
愛花「線香花火とかとてもキレイなんだよ〜楽しみだな〜」`},
        {
            source: "2024 愛花生日", time: "8/7", text: "", comment: `HappyBirthday相河愛花🦭
愛花「みんなプカプカしててかわいい～」
綾香「そうね、つい見ちゃうわ」
睦海「なんか茶柱みたい」
綾香「もう少しいい例えないわけ？」
愛花「そうなんだよ～、みんな茶柱って呼んでて」
綾香「えっ？」
睦海「ね、わかる」
綾香「ま、そうね、茶柱と言えなくもない」`},
    ];

    constructor() {

    }

    ngOnInit(): void {
        for (const timeline of this.timelines) {
            if (!timeline.type) {
                timeline.type = '';
            }
        }
    }
}
