import { Component, OnInit } from '@angular/core';

class TimeBlock {
    index: number = 10000;
    type: string;
    time: string;
    content: string;
    source: string;

    constructor(
        type: string,
        time: string,
        content: string,
        source: string,
    ) {
        this.time = time;
        this.content = content;
        this.type = type;
        this.source = source;
    }
}


@Component({
    selector: 'app-aika-timeline',
    templateUrl: './aika-timeline.component.html',
    styleUrls: ['./aika-timeline.component.scss']
})
export class AikaTimelineComponent implements OnInit {

    data = [
        ['company', `叢雲時期`, ``, ''],
        ['company', `成子坂時期`, ``, ''],
        ['node', '躍進編2章52', '愛花移籍成子坂，入社當日\n楓拜託隊長能收這兩孩子'],
        ['node', '躍進編2章53', '愛花綾香爭取出擊機會\n這時夜露還認為這兩人是後輩'],
        ['node', '躍進編2章55', '夜露請愛花綾香到咖啡廳加深感情\n被綾香教訓說你才是女演員後輩\n愛花說這裡的紅茶有香草的香味\n小結出場，拜託夜露多關照兩人\n不過這兩人在夜露回過頭就不見了'],
        ['node', '躍進編2章58', '整備部的裝備強化，聽取女演員們的意見\n愛花說想要可愛的裝備'],
        ['node', '躍進編2章62', '成子坂第一次開女演員會議\n愛花想靠戰鬥幫上忙'],
        ['node', '躍進編2章64', '四谷出差回來\n愛花簡單的點頭招呼\nBBA說出擊隊伍照往常一樣\n愛花綾香抱怨這樣我們不就被剩下了！\nBBA說新人教育交給她，等習慣之後在出擊'],
        ['node', '躍進編3章74', '成子坂補上接手叢雲之後的分數空缺\n愛花對分數補完，大家的活躍感到開心\n夜露害羞，綾香念夜露害羞個毛，不是你，愛花說:對，沒錯'
            + '\n狗子說不知不覺被排擠，愛花趕緊說:不對不對\n這個那個...不是那個意思啦，夜露當然也算在大家中' +
            + '\n綾香跑掉，愛花叫著綾香一起道歉，也跑掉了'],
        ['node', '躍進編4章88', '成子坂跟阿瑪女搶分，成子坂一時分數超越阿瑪女\n愛花跟夜露一起聽到消息，愛花覺的開心'],
        ['node', '躍進編5章89', '成子坂管理的部份區域被轉移到阿瑪女\n陽子說還請大家加油，愛花說我也會加油的！'],
        ['node', '躍進編5章90', '成子坂急著招人\n愛花說我們還只是新人，認識的只有叢雲3人而已，幫不上忙非常抱歉'
            +'\n綾香說我們在叢雲時還只是新人，不可能知道庶民女演員\n愛花念綾香不可以這樣說話啦'],
        ['node', '躍進編5章94', '愛花們在辦公室等阿星帶找到的新人女演員過來\n愛花期待(成子坂舞)\n然而阿星出場就跟BBA說的一樣，自己就是超可愛的新人女演員\n愛花震驚'],
        ['node', '躍進編5章102', '阿星把睦海拐來成子坂\n愛花看到睦海也來成子坂嚇一跳\n說什麼時候當上女演員了也不說一下\n我們是青梅竹馬，直接說也沒關係\n綾香提議睦海也加入，JC組3人隊伍成立'],
        ['node', '躍進編6章106', ''],
        ['node', '躍進編7章117', ''],
        ['node', '躍進編7章120', ''],
        ['node', '躍進編8章144', ''],
        ['node', '陰謀編1章145', ''],
        ['node', '激動編2章227', ''],
        ['node', '激動編3章\n地圖最下邊的劇情格子', ''],
        ['node', '激動編4章237', ''],
        ['node', '激動編4章240', ''],
        ['node', '激動編5章244', ''],
        ['node', '激動編5章249', ''],
        ['event', `秋季作戰後`, ``, ''],
        ['node', '覚醒編1章266', ''],
        ['node', '覚醒編2章283', ''],
        ['node', '覚醒編5章340', ''],
        ['node', '侵蝕編2章410', ''],
        ['node', '侵蝕編3章\n地圖右上兩分支的下面那條尾端的劇情格子', ''],
        ['node', '侵蝕編6章444', ''],
        ['node', '侵蝕編6章461', ''],
        ['node', '侵蝕編7章477', ''],
        ['node', ``, ``, ''],

        ['node', `愛花進入叢雲初期`, ``, ''],

        ['node', `移籍成子坂`, ``, ''],

        ['node', ``, ``, ''],
        ['node', ``, ``, ''],
        ['node', ``, ``, ''],
        ['node', ``, ``, ''],
    ];
    data2 = [
        ['node', '相河愛花\n1★角色劇情1', ''],
        ['node', '相河愛花\n2★角色劇情1', ''],
        ['node', '相河愛花\n3★角色劇情1', ''],
        ['node', '相河愛花\n3★角色劇情2', ''],
        ['node', '相河愛花\n3★角色劇情3', ''],
        ['node', '相河愛花\n4★角色劇情1', ''],
        ['node', '相河愛花\n4★角色劇情2', ''],
        ['node', '相河愛花\n4★角色劇情3', ''],
        ['node', '相河愛花\nAN角色劇情', ''],
        ['node', '相河愛花\n羈絆劇情EP1', ''],
        ['node', '相河愛花\n羈絆劇情EP2', ''],
        ['node', '相河愛花\n羈絆劇情EP3', ''],
        ['node', '相河愛花\n羈絆劇情EP4', ''],
        ['node', '相河愛花\n羈絆劇情EP5', ''],
        ['node', '一条綾香\n3★角色劇情1', ''],
        ['node', '一条綾香\n3★角色劇情2', ''],
        ['node', '一条綾香\n3★角色劇情3', ''],
        ['node', '一条綾香\nFA角色劇情1', ''],
        ['node', '一条綾香\n羈絆劇情EP1', ''],
        ['node', '一条綾香\n羈絆劇情EP2', ''],
        ['node', '一条綾香\n羈絆劇情EP3', ''],
        ['node', '一条綾香\n羈絆劇情EP4', ''],
        ['node', '一条綾香\n羈絆劇情EP5', ''],
        ['node', '小芦睦海\n1★角色劇情1', ''],
        ['node', '小芦睦海\n3★角色劇情2', ''],
        ['node', '小芦睦海\n3★角色劇情3', ''],
        ['node', '小芦睦海\n4★角色劇情1', ''],
        ['node', '小芦睦海\n4★角色劇情2', ''],
        ['node', '小芦睦海\n4★角色劇情3', ''],
        ['node', '小芦睦海\n羈絆劇情EP1', ''],
        ['node', '比良坂夜露\n4★角色劇情1', ''],
        ['node', '吾妻楓\n3★角色劇情1', ''],
        ['node', '日向リン\n4★角色劇情1', ''],
        ['node', '小鳥遊怜\n2★角色劇情1', ''],
        ['node', '小鳥遊怜\n3★角色劇情1', ''],
        ['node', '二子玉舞\n3★角色劇情1', ''],
        ['node', '二子玉舞\n3★角色劇情2', ''],
        ['node', '文島明日翔\n4★角色劇情1', ''],
        ['node', '文島明日翔\n4★角色劇情2', ''],
        ['node', '文島明日翔\n4★角色劇情3', ''],
        ['node', '大関小結\n2★角色劇情1', ''],
        ['node', '宇佐元杏奈\n3★角色劇情2', ''],
        ['node', '宇佐元杏奈\n羈絆劇情EP1', ''],
        ['node', '宇佐元杏奈\n羈絆劇情EP5', ''],
        ['node', '神宮寺真理\n3★角色劇情3', ''],
        ['node', '神宮寺真理\n羈絆劇情EP4', ''],
        ['node', '神宮寺真理\n羈絆劇情EP5', ''],
        ['node', '萬場盟華\n2★角色劇情1', ''],
        ['node', 'ミア・V\n羈絆劇情EP1', ''],
        ['node', 'ミア・V\n羈絆劇情EP3', ''],
        ['node', 'ミア・V\n羈絆劇情EP4', ''],
        ['node', '東雲チヱ\n3★角色劇情1', ''],
        ['node', '御蔵座梓希\n羈絆劇情EP1', ''],
        ['node', '山野薫子\n3★角色劇情1', ''],
        ['node', '山野薫子\n3★角色劇情3', ''],
        ['node', '二階堂司\n2★角色劇情1', ''],
        ['node', '御茶ノ水美里江\n3★角色劇情1', ''],
        ['node', 'リタ・H\n羈絆劇情EP5', ''],
        ['node', '源内あお\n4★角色劇情2', ''],
        ['node', '源内あお\n4★角色劇情3', ''],
        ['node', '宮藤芳佳\n3★角色劇情1', ''],
        ['node', 'ペリーヌ・C\n3★角色劇情1', ''],
        ['node', 'ペリーヌ・C\n4★角色劇情2', ''],
        ['node', 'ペリーヌ・C\n羈絆劇情EP2', ''],
        ['node', '星月みき\n4★角色劇情1', ''],
        ['node', '常磐くるみ\n4★角色劇情1', ''],
        ['node', '常磐くるみ\n4★角色劇情2', ''],
        ['node', '常磐くるみ\n4★角色劇情3', ''],
        ['node', '常磐くるみ\n羈絆劇情EP1', ''],
        ['node', '楠明日葉\n4★角色劇情3', ''],
        ['node', '煌上花音\n4★角色劇情2', ''],
        ['node', 'ヤマダ\n羈絆劇情EP1', ''],
        ['node', 'ターニャ\n羈絆劇情EP3', ''],
        ['node', '', ``],
        ['node', '', ``],
        ['node', '員工旅遊\nボーナスは社員旅行', ``],
        ['node', '成為偶像\nアイドル誕生！', ``],
        ['node', '\n杏奈のやって★トライ 後編', ``],
        ['node', '紅花餐車\n噂の屋台 ちゅうかな娘々', ``],
        ['node', '聯動FAG-2\nスティ子も来たよ！', ``],
        ['node', '臨海公園\n臨海公園でつかまえて', ``],
        ['node', '真理作夢\n隊長代行アタッカー薫子！ 外伝 ドリィミー真理', ``],
        ['node', '擁抱馬鞭草\nバーベナを抱きしめて', ``],
        ['node', '聖誕節2018\n成子坂のメリークリスマス', ``],
        ['node', '聖誕節2019\n', ``],
        ['node', '聖誕節2020\n', ``],
        ['node', '聖誕節2021\n', ``],
        ['node', '聯動\nストライクウィッチーズコラボ 交差する空', ``],
        ['node', '年底敲鐘2018', ``],
        ['node', '年底敲鐘2019', ``],
        ['node', '年底敲鐘2020', ``],
        ['node', '年底敲鐘2021', ``],
        ['node', '年底敲鐘2022', ``],
        ['node', '南國幻想\n南国幻想(トロピカルビーチ) あんなのクイズでぴょん！ぴょん！-外伝-', ``],
        ['node', '畢業', `AN愛花角色劇情`],
    ]

    blocks: TimeBlock[] = [];

    ngOnInit(): void {
        for (let i = 0; i < this.blocks.length; i++) {
            const element = this.blocks[i];
            element.index = 10000 + i;
        }
    }




}
